
#### Directory: 'azuread-users-groups-roles'
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`            

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azuread_client_config.current: Reading...[0m[0m
[0m[1mdata.azuread_client_config.current: Read complete after 0s [id=014901d1-96d2-44c7-b544-19cdb78cbb62-4c6e2a99-c195-4a94-86a3-454b5df9a81b-79c16aba-6d51-45b6-af39-de4f4ba929cb][0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/52209a4b-4500-4169-8059-48c84696155a][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # data.azurerm_resource_group.artgroup[0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "azurerm_resource_group" "artgroup" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m     = "artgroup"
      [32m+[0m [0m[1m[0mtags[0m[0m     = (known after apply)

      [32m+[0m [0mtimeouts {
          [32m+[0m [0m[1m[0mread[0m[0m = (known after apply)
        }
    }

[1m  # azuread_conditional_access_policy.Art_access_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_conditional_access_policy" "Art_access_policy" {
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Art policy"
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m        = "enabled"

      [32m+[0m [0mconditions {
          [32m+[0m [0m[1m[0mclient_app_types[0m[0m = [
              [32m+[0m [0m"all",
            ]

          [32m+[0m [0mapplications {
              [32m+[0m [0m[1m[0mexcluded_applications[0m[0m = []
              [32m+[0m [0m[1m[0mincluded_applications[0m[0m = [
                  [32m+[0m [0m"All",
                ]
            }

          [32m+[0m [0musers {
              [32m+[0m [0m[1m[0mincluded_groups[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mgrant_controls {
          [32m+[0m [0m[1m[0mbuilt_in_controls[0m[0m = [
              [32m+[0m [0m"mfa",
            ]
          [32m+[0m [0m[1m[0moperator[0m[0m          = "AND"
        }
    }

[1m  # azuread_group.Art[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_group" "Art" {
      [32m+[0m [0m[1m[0mauto_subscribe_new_members[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                   = "Art"
      [32m+[0m [0m[1m[0mexternal_senders_allowed[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_address_lists[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_outlook_clients[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmail[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmail_nickname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0monpremises_domain_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0monpremises_netbios_name[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sam_account_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0monpremises_security_identifier[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sync_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mowners[0m[0m                         = [
          [32m+[0m [0m"79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      [32m+[0m [0m[1m[0mpreferred_language[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprevent_duplicate_names[0m[0m        = false
      [32m+[0m [0m[1m[0mproxy_addresses[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_enabled[0m[0m               = true
      [32m+[0m [0m[1m[0mtypes[0m[0m                          = [
          [32m+[0m [0m"DynamicMembership",
        ]
      [32m+[0m [0m[1m[0mvisibility[0m[0m                     = (known after apply)

      [32m+[0m [0mdynamic_membership {
          [32m+[0m [0m[1m[0menabled[0m[0m = true
          [32m+[0m [0m[1m[0mrule[0m[0m    = "user.department -eq \"Art\""
        }
    }

[1m  # azuread_group.Engineering[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_group" "Engineering" {
      [32m+[0m [0m[1m[0mauto_subscribe_new_members[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                   = "Engineering"
      [32m+[0m [0m[1m[0mexternal_senders_allowed[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_address_lists[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_outlook_clients[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmail[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmail_nickname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0monpremises_domain_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0monpremises_netbios_name[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sam_account_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0monpremises_security_identifier[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sync_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mowners[0m[0m                         = [
          [32m+[0m [0m"79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      [32m+[0m [0m[1m[0mpreferred_language[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprevent_duplicate_names[0m[0m        = false
      [32m+[0m [0m[1m[0mproxy_addresses[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_enabled[0m[0m               = true
      [32m+[0m [0m[1m[0mtypes[0m[0m                          = [
          [32m+[0m [0m"DynamicMembership",
        ]
      [32m+[0m [0m[1m[0mvisibility[0m[0m                     = (known after apply)

      [32m+[0m [0mdynamic_membership {
          [32m+[0m [0m[1m[0menabled[0m[0m = true
          [32m+[0m [0m[1m[0mrule[0m[0m    = "user.department -eq \"Engineering\""
        }
    }

[1m  # azuread_group.Readers[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_group" "Readers" {
      [32m+[0m [0m[1m[0mauto_subscribe_new_members[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                   = "Readers"
      [32m+[0m [0m[1m[0mexternal_senders_allowed[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_address_lists[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mhide_from_outlook_clients[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mmail[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmail_nickname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0monpremises_domain_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0monpremises_netbios_name[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sam_account_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0monpremises_security_identifier[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sync_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mowners[0m[0m                         = [
          [32m+[0m [0m"79c16aba-6d51-45b6-af39-de4f4ba929cb",
        ]
      [32m+[0m [0m[1m[0mpreferred_language[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprevent_duplicate_names[0m[0m        = false
      [32m+[0m [0m[1m[0mproxy_addresses[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msecurity_enabled[0m[0m               = true
      [32m+[0m [0m[1m[0mtypes[0m[0m                          = [
          [32m+[0m [0m"DynamicMembership",
        ]
      [32m+[0m [0m[1m[0mvisibility[0m[0m                     = (known after apply)

      [32m+[0m [0mdynamic_membership {
          [32m+[0m [0m[1m[0menabled[0m[0m = true
          [32m+[0m [0m[1m[0mrule[0m[0m    = "user.userPrincipalName -contains \"jennasrunbooks\""
        }
    }

[1m  # azuread_user.Bob_Ross[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_user" "Bob_Ross" {
      [32m+[0m [0m[1m[0mabout_me[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0maccount_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mbusiness_phones[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mcreation_type[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdepartment[0m[0m                     = "Art"
      [32m+[0m [0m[1m[0mdisable_password_expiration[0m[0m    = false
      [32m+[0m [0m[1m[0mdisable_strong_password[0m[0m        = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                   = "Bob Ross"
      [32m+[0m [0m[1m[0mexternal_user_state[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mforce_password_change[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mim_addresses[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmail[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmail_nickname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0monpremises_distinguished_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0monpremises_domain_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0monpremises_immutable_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sam_account_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0monpremises_security_identifier[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sync_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_user_principal_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpassword[0m[0m                       = (sensitive value)
      [32m+[0m [0m[1m[0mproxy_addresses[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshow_in_address_list[0m[0m           = true
      [32m+[0m [0m[1m[0muser_principal_name[0m[0m            = "bobross@jennasrunbooks.com"
      [32m+[0m [0m[1m[0muser_type[0m[0m                      = (known after apply)
    }

[1m  # azuread_user.Roy_Trenneman[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_user" "Roy_Trenneman" {
      [32m+[0m [0m[1m[0mabout_me[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0maccount_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mbusiness_phones[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mcreation_type[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mdepartment[0m[0m                     = "Engineering"
      [32m+[0m [0m[1m[0mdisable_password_expiration[0m[0m    = false
      [32m+[0m [0m[1m[0mdisable_strong_password[0m[0m        = false
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m                   = "Roy Trenneman"
      [32m+[0m [0m[1m[0mexternal_user_state[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mforce_password_change[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mim_addresses[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mmail[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mmail_nickname[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0monpremises_distinguished_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0monpremises_domain_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0monpremises_immutable_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sam_account_name[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0monpremises_security_identifier[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0monpremises_sync_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0monpremises_user_principal_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpassword[0m[0m                       = (sensitive value)
      [32m+[0m [0m[1m[0mproxy_addresses[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mshow_in_address_list[0m[0m           = true
      [32m+[0m [0m[1m[0muser_principal_name[0m[0m            = "roytrenneman@jennasrunbooks.com"
      [32m+[0m [0m[1m[0muser_type[0m[0m                      = (known after apply)
    }

[1m  # azurerm_resource_group.artgroup[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "artgroup" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus2"
      [32m+[0m [0m[1m[0mname[0m[0m     = "artgroup"
    }

[1m  # azurerm_role_assignment.Contributor_role_art[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "Contributor_role_art" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Contributor"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # azurerm_role_assignment.Custom_storage_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "Custom_storage_role" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "CustomStorageRole"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a"
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # azurerm_role_assignment.Reader_role_all[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "Reader_role_all" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Reader"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a"
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # azurerm_role_definition.Custom_storage_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_definition" "Custom_storage_role" {
      [32m+[0m [0m[1m[0massignable_scopes[0m[0m           = [
          [32m+[0m [0m"/subscriptions/52209a4b-4500-4169-8059-48c84696155a",
        ]
      [32m+[0m [0m[1m[0mdescription[0m[0m                 = "Custom storage role definition"
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                        = "CustomStorageRole"
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_resource_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mscope[0m[0m                       = "/subscriptions/52209a4b-4500-4169-8059-48c84696155a"

      [32m+[0m [0mpermissions {
          [32m+[0m [0m[1m[0mactions[0m[0m     = [
              [32m+[0m [0m"Microsoft.Storage/storageAccounts/listKeys/action",
              [32m+[0m [0m"Microsoft.Storage/storageAccounts/regeneratekey/action",
              [32m+[0m [0m"Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action",
            ]
          [32m+[0m [0m[1m[0mnot_actions[0m[0m = []
        }
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: ci.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "ci.plan"

```

</details>

*Pushed by: @jksprattler, Action: `pull_request`*